#! /usr/bin/env python3 

"""<--HI USER-->"""
"""<--TASK-->"""
""" 
Напишите программу, запрашивающую у пользователя его имя. В ответ
на ввод на экране должно появиться приветствие с обращением по имени,
введенному с клавиатуры ранее.
"""

message = 'Enter name for User --> '

name = input(message)

print(f'Hi, {name}!')