#! /usr/bin/env python3 

"""<--POST MAN-->"""

"""<--TASK-->"""
""" 
Напишите несколько строк кода, выводящих на экран ваше имя и почто-
вый адрес. Адрес напишите в формате, принятом в вашей стране. Ника-
кого ввода от пользователя ваша первая программа принимать не будет,
только вывод на экран и больше ничего.
"""

my_name = 'Olala'
may_post_index = 1234

print(f'My Name --> {my_name} and my post index --> {may_post_index}')